pmo-dataset/graphviz/37.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Contract project\nreceived" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "Query the next shop";
  "Create a list of the\nparts" -> "ExclusiveGateway_2";
  "Query the next shop" -> "Ask about quantity,\nprice and deadline";
  "Ask about quantity,\nprice and deadline" -> "Terms acceptable?";
  "Terms acceptable?" -> "ExclusiveGateway_2" [label="No"];
  "Terms acceptable?" -> "Create a list of the\nparts" [label="Yes"];
  "ExclusiveGateway_2" -> "More parts needed?";
  "More parts needed?" -> "ExclusiveGateway_1" [label="Yes"];
  "More parts needed?" -> "ParallelGateway" [label="No"];
  "ParallelGateway" -> "Receive first batch\nof parts";
  "ParallelGateway" -> "Receive second batch\nof parts";
  "ParallelGateway" -> "Receive third batch\nof parts";
  "Receive first batch\nof parts" -> "First parts arrived";
  "Receive second batch\nof parts" -> "First parts arrived";
  "Receive third batch\nof parts" -> "First parts arrived";
  "First parts arrived" -> "Start/Continue\nbuilding";
  "Start/Continue\nbuilding" -> "Any stock falls?";
  "Any stock falls?" -> "How much is the\nstock fall?" [label="Yes"];
  "Reorder the part as\nfast as possible" -> "ExclusiveGateway_4";
  "Reorder the cheapest\npart" -> "ExclusiveGateway_4";
  "Complain to the\nfriends" -> "ExclusiveGateway_4";
  "ExclusiveGateway_4" -> "ExclusiveGateway_3";
  "Any stock falls?" -> "ExclusiveGateway_3" [label="No"];
  "How much is the\nstock fall?" -> "Reorder the cheapest\npart" [label="Below 5"];
  "How much is the\nstock fall?" -> "Reorder the part as\nfast as possible" [label="Below 3"];
  "How much is the\nstock fall?" -> "Complain to the\nfriends" [label="Zero"];
  "ExclusiveGateway_3" -> "Contract fullfilled?";
  "Contract fullfilled?" -> "Start/Continue\nbuilding" [label="No"];
  "Contract fullfilled?" -> "Project completed" [label="Yes"];

  "Contract project\nreceived" [shape=circle];
  "Project completed" [shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "Terms acceptable?" [shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "More parts needed?" [shape=diamond];
  "Any stock falls?" [shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "How much is the\nstock fall?" [shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "Contract fullfilled?" [shape=diamond];
  "ParallelGateway" [label="+", shape=diamond];
  "First parts arrived" [shape=diamond];
}
